---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDirn1
source: html/925e31bd-caf9-22c0-c723-c040554370b3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDirn1 Property

"Top Major Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeTopDirn1 { get; }
```